lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/pf1550/fsl_pf1550.c
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_common.h"
#include "fsl_pf1550.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/* INT_CATEGORY bit-field. */
#define PF1550_INT_CATEGORY_CHG_INT_MASK   (0x01U)
#define PF1550_INT_CATEGORY_SW1_INT_MASK   (0x02U)
#define PF1550_INT_CATEGORY_SW2_INT_MASK   (0x04U)
#define PF1550_INT_CATEGORY_SW3_INT_MASK   (0x08U)
#define PF1550_INT_CATEGORY_LDO_INT_MASK   (0x10U)
#define PF1550_INT_CATEGORY_ONKEY_INT_MASK (0x20U)
#define PF1550_INT_CATEGORY_TEMP_INT_MASK  (0x40U)
#define PF1550_INT_CATEGORY_MISC_INT_MASK  (0x80U)
/* REGULATOR_CTRL bit-field. */
#define PF1550_REGULATOR_CTRL_EN_MASK       (0x01U)
#define PF1550_REGULATOR_CTRL_STBY_EN_MASK  (0x02U)
#define PF1550_REGULATOR_CTRL_OMODE_MASK    (0x04U)
#define PF1550_REGULATOR_CTRL_SYSON_EN_MASK (0x07U)
/* SW_CTRL bit-field. */
#define PF1550_SW_CTRL_LPWR_MASK      (0x08U)
#define PF1550_SW_CTRL_DVSSPEED_MASK  (0x10U)
#define PF1550_SW_CTRL_DVSSPEED_SHIFT (4U)
#define PF1550_SW_CTRL_DVSSPEED(x) \
    (((uint8_t)((uint8_t)(x) << PF1550_SW_CTRL_DVSSPEED_SHIFT)) & PF1550_SW_CTRL_DVSSPEED_MASK)
#define PF1550_SW_CTRL_FPWM_IN_DVS_MASK (0x20U)
#define PF1550_SW_CTRL_FPWM_MASK        (0x40U)
#define PF1550_SW_CTRL_RDIS_EN_MASK     (0x80U)
/* LDO_CTRL bit-field. */
#define PF1550_LDO_CTRL_LPWR_MASK  (0x08U)
#define PF1550_LDO_CTRL_LS_EN_MASK (0x10U)
/* COINCELL bit-field. */
#define PF1550_COINCELL_CONTROL_COINCHEN_MASK (0x10U)
/* VSNVS_CTRL bit-field. */
#define PF1550_VSNVS_CTRL_LIBGDIS_MASK (0x20U)
/* PWRCTRL0 bit-field. */
#define PF1550_PWRCTRL0_STANDBYDLY_MASK  (0x03U)
#define PF1550_PWRCTRL0_STANDBYINV_MASK  (0x04U)
#define PF1550_PWRCTRL0_STANDBYINV_SHIFT (2U)
#define PF1550_PWRCTRL0_STANDBYINV(x) \
    (((uint8_t)((uint8_t)(x) << PF1550_PWRCTRL0_STANDBYINV_SHIFT)) & PF1550_PWRCTRL0_STANDBYINV_MASK)
#define PF1550_PWRCTRL0_POR_DLY_MASK  (0x38U)
#define PF1550_PWRCTRL0_POR_DLY_SHIFT (3U)
#define PF1550_PWRCTRL0_POR_DLY(x) \
    (((uint8_t)((uint8_t)(x) << PF1550_PWRCTRL0_POR_DLY_SHIFT)) & PF1550_PWRCTRL0_POR_DLY_MASK)
#define PF1550_PWRCTRL0_TGRESET_MASK  (0xC0U)
#define PF1550_PWRCTRL0_TGRESET_SHIFT (6U)
#define PF1550_PWRCTRL0_TGRESET(x) \
    (((uint8_t)((uint8_t)(x) << PF1550_PWRCTRL0_TGRESET_SHIFT)) & PF1550_PWRCTRL0_TGRESET_MASK)
/* PWRCTRL1 bit-field. */
#define PF1550_PWRCTRL1_PWRONDBNC_MASK  (0x03U)
#define PF1550_PWRCTRL1_PWRONRSTEN_MASK (0x10U)
#define PF1550_PWRCTRL1_RESTARTEN_MASK  (0x20U)
#define PF1550_PWRCTRL1_ONKEYDBNC_MASK  (0x0CU)
#define PF1550_PWRCTRL1_ONKEYDBNC_SHIFT (2U)
#define PF1550_PWRCTRL1_ONKEYDBNC(x) \
    (((uint8_t)((uint8_t)(x) << PF1550_PWRCTRL1_ONKEYDBNC_SHIFT)) & PF1550_PWRCTRL1_ONKEYDBNC_MASK)
#define PF1550_PWRCTRL1_REGSCPEN_MASK     (0x40U)
#define PF1550_PWRCTRL1_ONKEY_RST_EN_MASK (0x80U)
/* PWRCTRL2 bit-field. */
#define PF1550_PWRCTRL2_UVDET_MASK (0x03U)
/* OTP_SW1_SW2 bit-field. */
#define PF1550_OTP_SW1_SW2_OTP_SW1_DVS_ENB_MASK (0x02U)
/* OTP_SW2_SW3 bit-field. */
#define PF1550_OTP_SW2_SW3_OTP_SW2_DVS_ENB_MASK (0x08U)

/* Regulator Control Helper Macros. */
#define PF1550_SWX_SET_POINT_NUM        (64U)
#define PF1550_SWX_OUTPUT_LIMIT_LOW_DVS (600000U)
#define PF1550_SWX_OUTPUT_STEP_DVS      (12500U)
#define PF1550_SWY_SET_POINT_NUM        (16U)
#define PF1550_SWY_OUTPUT_LIMIT_LOW     (1800000U)
#define PF1550_SWY_OUTPUT_STEP          (100000U)
#define PF1550_LDOX_SET_POINT_NUM       (16U)
#define PF1550_LDOX_OUTPUT_LIMIT_LOW    (1800000U)
#define PF1550_LDOX_OUTPUT_STEP         (100000U)
#define PF1550_LDOY_SET_POINT_NUM       (32U)
#define PF1550_LDOY_SET_POINT_LOW_NUM   (16U)
#define PF1550_LDOY_OUTPUT_LIMIT_LOW    (750000U)
#define PF1550_LDOY_OUTPUT_STEP_LOW     (50000U)
#define PF1550_LDOY_OUTPUT_LIMIT_MID    (1800000U)
#define PF1550_LDOY_OUTPUT_STEP_HIGH    (100000U)
#define PF1550_VSNVS_OUTPUT_VOLTAGE     (3300000U)

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Variables
 ******************************************************************************/
static const uint8_t powerDownRegTab[] = {
    PF1550_SW1_PWRDN_SEQ,
    PF1550_SW2_PWRDN_SEQ,
    PF1550_SW3_PWRDN_SEQ,
    PF1550_LDO1_PWRDN_SEQ,
    PF1550_LDO2_PWRDN_SEQ,
    PF1550_LDO3_PWRDN_SEQ,
    0x0,
    PF1550_VREFDDR_PWRDN_SEQ,
};
static const uint8_t regulatorCtrlRegTab[] = {
    PF1550_SW1_CTRL,  PF1550_SW2_CTRL,  PF1550_SW3_CTRL,   PF1550_LDO1_CTRL,
    PF1550_LDO2_CTRL, PF1550_LDO3_CTRL, PF1550_VSNVS_CTRL, PF1550_VREFDDR_CTRL,
};
static const uint8_t regulatorVoltRegTab[] = {
    PF1550_SW1_VOLT, PF1550_SW2_VOLT, PF1550_SW3_VOLT, PF1550_LDO1_VOLT, PF1550_LDO2_VOLT, PF1550_LDO3_VOLT, 0x0, 0x0,
};
static const uint32_t regulatorSwVoltSetPonitTab[] = {
    1100000U, 1200000U, 1350000U, 1500000U, 1800000U, 2500000U, 3000000U, 3300000U,
};

/*******************************************************************************
 * Code
 ******************************************************************************/

static bool PF1550_ReadOtp(pf1550_handle_t *handle, uint8_t reg, uint8_t *val)
{
    bool result = false;

    assert(handle);
    assert(val);

    result = PF1550_WriteReg(handle, PF1550_KEY1, 0x15);
    if (true == result)
    {
        result = PF1550_WriteReg(handle, PF1550_CHGR_KEY2, 0x50);
        if (true == result)
        {
            result = PF1550_WriteReg(handle, PF1550_KEY3, 0xAB);
            if (true == result)
            {
                result = PF1550_WriteReg(handle, PF1550_FMRADDR, reg);
                if (true == result)
                {
                    result = PF1550_ReadReg(handle, PF1550_FMRDATA, val);
                }
            }
        }
    }

    return result;
}

