lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/pf1550/fsl_pf1550.c
void PF1550_GetDefaultConfig(pf1550_config_t *config)
{
    assert(config);

    /* Set callback function to NULL Pointer. */
    config->I2C_SendFunc    = NULL;
    config->I2C_ReceiveFunc = NULL;

    /* Under-Voltage interrupt will assert when Vsys rising voltage cross 3.0V
     * or Vsys rising voltage cross 2.9V. */
    config->threshold = kPF1550_UnderVoltDetThres_Rising3V0Falling2V9;
    /* PF1550 reset MCU 2ms later after last regulator power up. */
    config->delay = kPF1550_PowerUpDelay_2ms;
    /* PF1550 will not disable LDO when Current Limit Fault occur. */
    config->shutDownLdoInCurrentFault = false;
    /* Set Default Slave Address. */
    config->slaveAddress = PF1550_DEFAULT_I2C_ADDR;
}

void PF1550_Init(pf1550_handle_t *handle, const pf1550_config_t *config)
{
    assert(handle);
    assert(config);

    /* Initialize Callback functions. */
    handle->I2C_SendFunc    = config->I2C_SendFunc;
    handle->I2C_ReceiveFunc = config->I2C_ReceiveFunc;
    /* Set Slave Address. */
    handle->slaveAddress = config->slaveAddress;

    /* Set Vsys Under-Voltage Detection Threshold. */
    (void)PF1550_ModifyReg(handle, PF1550_PWRCTRL2, PF1550_PWRCTRL2_UVDET_MASK, (uint8_t)(config->threshold));
    /* Set Power Up Delay Time. */
    (void)PF1550_ModifyReg(handle, PF1550_PWRCTRL0, PF1550_PWRCTRL0_POR_DLY_MASK,
                           PF1550_PWRCTRL0_POR_DLY(config->delay));
    /* Shuts down LDO if it enters a current limit fault. */
    (void)PF1550_ModifyReg(handle, PF1550_PWRCTRL1, PF1550_PWRCTRL1_REGSCPEN_MASK,
                           config->shutDownLdoInCurrentFault ? PF1550_PWRCTRL1_REGSCPEN_MASK : 0x0U);
}

bool PF1550_WriteReg(pf1550_handle_t *handle, uint8_t reg, uint8_t val)
{
    assert(handle);
    assert(handle->I2C_SendFunc);

    return (kStatus_Success == handle->I2C_SendFunc(handle->slaveAddress, reg, 1U, &val, 1U)) ? true : false;
}

bool PF1550_ReadReg(pf1550_handle_t *handle, uint8_t reg, uint8_t *val)
{
    assert(handle);
    assert(handle->I2C_ReceiveFunc);
    assert(val);

    return (kStatus_Success == handle->I2C_ReceiveFunc(handle->slaveAddress, reg, 1U, val, 1U)) ? true : false;
}

bool PF1550_ModifyReg(pf1550_handle_t *handle, uint8_t reg, uint8_t mask, uint8_t val)
{
    bool result      = false;
    uint8_t regValue = 0U;

    assert(handle);

    /* Read back the register content. */
    result = PF1550_ReadReg(handle, reg, &regValue);
    if (true == result)
    {
        /* Modify the bit-fields you want to change. */
        regValue &= (uint8_t)~mask;
        regValue |= val;

        /* Write back the content to the registers. */
        result = PF1550_WriteReg(handle, reg, regValue);
    }

    return result;
}

bool PF1550_DumpReg(pf1550_handle_t *handle, uint8_t reg, uint8_t *buffer, uint8_t size)
{
    bool result = true;
    uint8_t i;

    assert(handle);
    assert(buffer);

    /* It seems that PF1550 only supports single-byte I2C transactions
       for read and write. */
    for (i = 0; i < size; i++)
    {
        if (false == PF1550_ReadReg(handle, reg++, buffer++))
        {
            result = false;
        }
    }

    return result;
}

uint32_t PF1550_GetInterruptCategory(pf1550_handle_t *handle)
{
    uint8_t category = 0U;

    assert(handle);

    /* It seems that PF1550 only support  */
    (void)PF1550_ReadReg(handle, PF1550_INT_CATEGORY, &category);

    return category;
}

void PF1550_EnableInterrupts(pf1550_handle_t *handle, pf1550_interrupt_category_t category, uint32_t source)
{
    assert(handle);

    switch (category)
    {
        case kPF1550_IntCategoryCharger:
            /* Enable Charger interrupts. */
            (void)PF1550_ModifyReg(handle, PF1550_CHG_INT_MASK, (uint8_t)(source & 0xFFU), 0x0U);
            break;

        case kPF1550_IntCategorySwitch:
            /* Enable Switch low side current limit interrupts. */
            (void)PF1550_ModifyReg(handle, PF1550_SW_INT_MASK0, (uint8_t)(source & 0xFFU), 0x0U);
            /* Enable Switch high side current limit interrupts. */
            (void)PF1550_ModifyReg(handle, PF1550_SW_INT_MASK1, (uint8_t)((source & 0xFF00U) >> 8U), 0x0U);
            /* Enable Switch DVS complete interrupts. */
            (void)PF1550_ModifyReg(handle, PF1550_SW_INT_MASK2, (uint8_t)((source & 0xFF0000U) >> 16U), 0x0U);
            break;

        case kPF1550_IntCategoryLdo:
            /* Enable LDO current limit fault interrupts. */
            (void)PF1550_ModifyReg(handle, PF1550_LDO_INT_MASK0, (uint8_t)(source & 0xFFU), 0x0U);
            break;

        case kPF1550_IntCategoryOnkey:
            /* Enable ONKEY Press interrupts. */
            (void)PF1550_ModifyReg(handle, PF1550_ONKEY_INT_MASK0, (uint8_t)(source & 0xFFU), 0x0U);
            break;

        case kPF1550_IntCategoryTemp:
            /* Enable Die Temperature Cross interrupts. */
            (void)PF1550_ModifyReg(handle, PF1550_TEMP_INT_MASK0, (uint8_t)(source & 0xFFU), 0x0U);
            break;

        case kPF1550_IntCategoryMisc:
            /* Enable Misc. interrupts. */
            (void)PF1550_ModifyReg(handle, PF1550_MISC_INT_MASK0, (uint8_t)(source & 0xFFU), 0x0U);
            break;

        default:
            assert(false);
            break;
    }
}

void PF1550_DisableInterrupts(pf1550_handle_t *handle, pf1550_interrupt_category_t category, uint32_t source)
{
    assert(handle);

    switch (category)
    {
        case kPF1550_IntCategoryCharger:
            /* TODO: Add charger Interrupt Enable Logic here. */
            break;

        case kPF1550_IntCategorySwitch:
            /* Disable Switch low side current limit interrupts. */
            (void)PF1550_ModifyReg(handle, PF1550_SW_INT_MASK0, 0x0U, (uint8_t)(source & 0xFFU));
            /* Disable Switch high side current limit interrupts. */
            (void)PF1550_ModifyReg(handle, PF1550_SW_INT_MASK1, 0x0U, (uint8_t)((source & 0xFF00U) >> 8U));
            /* Disable Switch DVS complete interrupts. */
            (void)PF1550_ModifyReg(handle, PF1550_SW_INT_MASK2, 0x0U, (uint8_t)((source & 0xFF0000U) >> 16U));
            break;

        case kPF1550_IntCategoryLdo:
            /* Disable LDO current limit fault interrupts. */
            (void)PF1550_ModifyReg(handle, PF1550_LDO_INT_MASK0, 0x0U, (uint8_t)(source & 0xFFU));
            break;

