lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/pf1550/fsl_pf1550.c
        case kPF1550_IntCategoryOnkey:
            /* Disable ONKEY Press interrupts. */
            (void)PF1550_ModifyReg(handle, PF1550_ONKEY_INT_MASK0, 0x0U, (uint8_t)(source & 0xFFU));
            break;

        case kPF1550_IntCategoryTemp:
            /* Disable Die Temperature Cross interrupts. */
            (void)PF1550_ModifyReg(handle, PF1550_TEMP_INT_MASK0, 0x0U, (uint8_t)(source & 0xFFU));
            break;

        case kPF1550_IntCategoryMisc:
            /* Disable Misc. interrupts. */
            (void)PF1550_ModifyReg(handle, PF1550_MISC_INT_MASK0, 0x0U, (uint8_t)(source & 0xFFU));
            break;

        default:
            assert(false);
            break;
    }
}

uint32_t PF1550_GetInterruptStatus(pf1550_handle_t *handle, pf1550_interrupt_category_t category)
{
    uint32_t status = 0x0U;
    uint8_t temp    = 0U;

    assert(handle);

    switch (category)
    {
        case kPF1550_IntCategoryCharger:
            /* Get Charger interrupt flags. */
            (void)PF1550_ReadReg(handle, PF1550_CHG_INT, &temp);
            status = temp;
            break;

        case kPF1550_IntCategorySwitch:
            /* Get Switch low side current limit interrupt flags. */
            (void)PF1550_ReadReg(handle, PF1550_SW_INT_STAT0, &temp);
            status = temp;

            /* Get Switch high side current limit interrupt flags. */
            (void)PF1550_ReadReg(handle, PF1550_SW_INT_STAT1, &temp);
            status |= (uint32_t)((uint32_t)temp << 8U);

            /* Get Switch DVS complete interrupt flags. */
            (void)PF1550_ReadReg(handle, PF1550_SW_INT_STAT2, &temp);
            status |= (uint32_t)((uint32_t)temp << 16U);
            break;

        case kPF1550_IntCategoryLdo:
            /* Get LDO current limit fault interrupt flags. */
            (void)PF1550_ReadReg(handle, PF1550_LDO_INT_STAT0, &temp);
            status = temp;
            break;

        case kPF1550_IntCategoryOnkey:
            /* Get ONKEY Press interrupt flags. */
            (void)PF1550_ReadReg(handle, PF1550_ONKEY_INT_STAT0, &temp);
            status = temp;
            break;

        case kPF1550_IntCategoryTemp:
            /* Get Die Temperature Cross interrupt flags. */
            (void)PF1550_ReadReg(handle, PF1550_TEMP_INT_STAT0, &temp);
            status = temp;
            break;

        case kPF1550_IntCategoryMisc:
            /* Get Misc. interrupt flags. */
            (void)PF1550_ReadReg(handle, PF1550_MISC_INT_STAT0, &temp);
            status = temp;
            break;

        default:
            assert(false);
            break;
    }

    return status;
}

void PF1550_ClearInterruptStatus(pf1550_handle_t *handle, pf1550_interrupt_category_t category, uint32_t source)
{
    assert(handle);

    /* interrupt status bits are w1c. */
    switch (category)
    {
        case kPF1550_IntCategoryCharger:
            /* Clear Charger interrupts. */
            (void)PF1550_WriteReg(handle, PF1550_CHG_INT, (uint8_t)(source & 0xFFU));
            break;

        case kPF1550_IntCategorySwitch:
            /* Clear Switch low side current limit interrupts. */
            (void)PF1550_WriteReg(handle, PF1550_SW_INT_STAT0, (uint8_t)(source & 0xFFU));
            /* Clear Switch high side current limit interrupts. */
            (void)PF1550_WriteReg(handle, PF1550_SW_INT_STAT1, (uint8_t)((source & 0xFF00U) >> 8U));
            /* Clear Switch DVS complete interrupts. */
            (void)PF1550_WriteReg(handle, PF1550_SW_INT_STAT2, (uint8_t)((source & 0xFF0000U) >> 16U));
            break;

        case kPF1550_IntCategoryLdo:
            /* Clear LDO current limit fault interrupts. */
            (void)PF1550_WriteReg(handle, PF1550_LDO_INT_STAT0, (uint8_t)(source & 0xFFU));
            break;

        case kPF1550_IntCategoryOnkey:
            /* Clear ONKEY Press interrupts. */
            (void)PF1550_WriteReg(handle, PF1550_ONKEY_INT_STAT0, (uint8_t)(source & 0xFFU));
            break;

        case kPF1550_IntCategoryTemp:
            /* Clear Die Temperature Cross interrupts. */
            (void)PF1550_WriteReg(handle, PF1550_TEMP_INT_STAT0, (uint8_t)(source & 0xFFU));
            break;

        case kPF1550_IntCategoryMisc:
            /* Clear Misc. interrupts. */
            (void)PF1550_WriteReg(handle, PF1550_MISC_INT_STAT0, (uint8_t)(source & 0xFFU));
            break;

        default:
            assert(false);
            break;
    }
}

void PF1550_EnableRegulator(pf1550_handle_t *handle,
                            pf1550_module_t module,
                            pf1550_operating_status_t status,
                            bool enable)
{
    uint8_t regulatorCtrlRegAddr;

    assert(handle);
    /* Regulators are only enabled in any of the System On Statues. */
    assert((kPF1550_OperatingStatusRun == status) || (kPF1550_OperatingStatusStandby == status) ||
           (kPF1550_OperatingStatusSleep == status) || (kPF1550_OperatingStatusSystemOn == status));

    /* There is no enable/disable switch for Vsnvs. */
    if (kPF1550_ModuleVsnvs == module)
    {
        return;
    }

    /* Get Regulator Control Register Address. */
    regulatorCtrlRegAddr = regulatorCtrlRegTab[module];

    switch (status)
    {
        case kPF1550_OperatingStatusRun:
            (void)PF1550_ModifyReg(handle, regulatorCtrlRegAddr, PF1550_REGULATOR_CTRL_EN_MASK,
                                   (enable ? PF1550_REGULATOR_CTRL_EN_MASK : 0x0U));
            break;

        case kPF1550_OperatingStatusStandby:
            (void)PF1550_ModifyReg(handle, regulatorCtrlRegAddr, PF1550_REGULATOR_CTRL_STBY_EN_MASK,
                                   (enable ? PF1550_REGULATOR_CTRL_STBY_EN_MASK : 0x0U));
            break;

        case kPF1550_OperatingStatusSleep:
            (void)PF1550_ModifyReg(handle, regulatorCtrlRegAddr, PF1550_REGULATOR_CTRL_OMODE_MASK,
                                   (enable ? PF1550_REGULATOR_CTRL_OMODE_MASK : 0x0U));
            break;

        case kPF1550_OperatingStatusSystemOn:
            (void)PF1550_ModifyReg(handle, regulatorCtrlRegAddr, PF1550_REGULATOR_CTRL_SYSON_EN_MASK,
                                   (enable ? PF1550_REGULATOR_CTRL_SYSON_EN_MASK : 0x0U));
            break;

        default:
            assert(false);
            break;
    }
}

bool PF1550_IsRegulatorEnabled(pf1550_handle_t *handle, pf1550_module_t module, pf1550_operating_status_t status)
{
    bool result;
    uint8_t regulatorCtrlRegAddr;
    uint8_t regulatorCtrlRegContent = 0U;

