lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/pf1550/fsl_pf1550.c
    assert(handle);
    /* Regulators are only enabled in any of the System On Statues. */
    assert((kPF1550_OperatingStatusRun == status) || (kPF1550_OperatingStatusStandby == status) ||
           (kPF1550_OperatingStatusSleep == status) || (kPF1550_OperatingStatusSystemOn == status));

    /* There is no enable/disable switch for Vsnvs. */
    if (kPF1550_ModuleVsnvs == module)
    {
        result = true;
    }
    else
    {
        /* Get Regulator Control Register Content. */
        regulatorCtrlRegAddr = regulatorCtrlRegTab[module];
        (void)PF1550_ReadReg(handle, regulatorCtrlRegAddr, &regulatorCtrlRegContent);

        switch (status)
        {
            case kPF1550_OperatingStatusRun:
                result = ((regulatorCtrlRegContent & PF1550_REGULATOR_CTRL_EN_MASK) != 0U) ? true : false;
                break;

            case kPF1550_OperatingStatusStandby:
                result = ((regulatorCtrlRegContent & PF1550_REGULATOR_CTRL_STBY_EN_MASK) != 0U) ? true : false;
                break;

            case kPF1550_OperatingStatusSleep:
                result = ((regulatorCtrlRegContent & PF1550_REGULATOR_CTRL_OMODE_MASK) != 0U) ? true : false;
                break;

            case kPF1550_OperatingStatusSystemOn:
                result = ((regulatorCtrlRegContent & PF1550_REGULATOR_CTRL_SYSON_EN_MASK) ==
                          PF1550_REGULATOR_CTRL_SYSON_EN_MASK) ?
                             true :
                             false;
                break;

            default:
                result = false;
                break;
        }
    }

    return result;
}

void PF1550_SetRegulatorOutputVoltage(pf1550_handle_t *handle,
                                      pf1550_module_t module,
                                      pf1550_operating_status_t status,
                                      uint32_t voltage)
{
    uint8_t regulatorVoltRegAddr;
    uint8_t regulatorVoltRegContent;

    assert(handle);
    /* Regulators are only enabled in any of the System On Statues. */
    assert((kPF1550_OperatingStatusRun == status) || (kPF1550_OperatingStatusStandby == status) ||
           (kPF1550_OperatingStatusSleep == status) || (kPF1550_OperatingStatusSystemOn == status));

    /* Return directly if regulator does not support DVS feature. */
    if (PF1550_IsRegulatorSupportDvs(handle, module))
    {
        /* Get Regulator Output Set Point. */
        regulatorVoltRegAddr    = regulatorVoltRegTab[module];
        regulatorVoltRegContent = PF1550_GetRegulatorSetPoint(handle, module, voltage);

        /* There is only one regulator output voltage control register for LDO.
           So regulator output set for any operating status to LDO will affect
           all operating status. */
        if ((kPF1550_ModuleLdo1 == module) || (kPF1550_ModuleLdo2 == module) || (kPF1550_ModuleLdo3 == module))
        {
            (void)PF1550_WriteReg(handle, regulatorVoltRegAddr, regulatorVoltRegContent);
        }
        else
        {
            switch (status)
            {
                case kPF1550_OperatingStatusRun:
                    (void)PF1550_WriteReg(handle, regulatorVoltRegAddr, regulatorVoltRegContent);
                    break;

                case kPF1550_OperatingStatusStandby:
                    (void)PF1550_WriteReg(handle, regulatorVoltRegAddr + (PF1550_SW1_STBY_VOLT - PF1550_SW1_VOLT),
                                          regulatorVoltRegContent);
                    break;

                case kPF1550_OperatingStatusSleep:
                    (void)PF1550_WriteReg(handle, regulatorVoltRegAddr + (PF1550_SW1_SLP_VOLT - PF1550_SW1_VOLT),
                                          regulatorVoltRegContent);
                    break;

                case kPF1550_OperatingStatusSystemOn:
                    (void)PF1550_WriteReg(handle, regulatorVoltRegAddr, regulatorVoltRegContent);
                    (void)PF1550_WriteReg(handle, regulatorVoltRegAddr + (PF1550_SW1_STBY_VOLT - PF1550_SW1_VOLT),
                                          regulatorVoltRegContent);
                    (void)PF1550_WriteReg(handle, regulatorVoltRegAddr + (PF1550_SW1_SLP_VOLT - PF1550_SW1_VOLT),
                                          regulatorVoltRegContent);
                    break;

                default:
                    assert(false);
                    break;
            }
        }
    }
}

uint32_t PF1550_GetRegulatorOutputVoltage(pf1550_handle_t *handle,
                                          pf1550_module_t module,
                                          pf1550_operating_status_t status)
{
    uint8_t regulatorVoltRegAddr;
    uint8_t regulatorVoltRegContent = 0U;
    uint32_t voltage                = 0U;

    assert(handle);
    /* Regulators are only enabled in any of the System On Statues. */
    assert((kPF1550_OperatingStatusRun == status) || (kPF1550_OperatingStatusStandby == status) ||
           (kPF1550_OperatingStatusSleep == status) || (kPF1550_OperatingStatusSystemOn == status));

    switch (module)
    {
        /* Get LDO output voltage. */
        case kPF1550_ModuleLdo1:
        case kPF1550_ModuleLdo2:
        case kPF1550_ModuleLdo3:
            /* Get Regulator Voltage Regulator. */
            regulatorVoltRegAddr = regulatorVoltRegTab[module];
            (void)PF1550_ReadReg(handle, regulatorVoltRegAddr, &regulatorVoltRegContent);
            voltage = PF1550_GetRegulatorOutputVolt(handle, module, regulatorVoltRegContent);
            break;

        /* Get Switch output voltage by operating status. */
        case kPF1550_ModuleSwitch1:
        case kPF1550_ModuleSwitch2:
        case kPF1550_ModuleSwitch3:
            /* Get Regulator Voltage Regulator. */
            regulatorVoltRegAddr = regulatorVoltRegTab[module];
            switch (status)
            {
                case kPF1550_OperatingStatusRun:
                    (void)PF1550_ReadReg(handle, regulatorVoltRegAddr, &regulatorVoltRegContent);
                    voltage = PF1550_GetRegulatorOutputVolt(handle, module, regulatorVoltRegContent);
                    break;

