lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/pf1550/fsl_pf1550.c
    /* Set Power Control Register 0. */
    (void)PF1550_ModifyReg(handle, PF1550_PWRCTRL0, PF1550_PWRCTRL0_TGRESET_MASK,
                           (uint8_t)PF1550_PWRCTRL0_TGRESET(attribute->pushTime));
}

void PF1550_SetPwrOnPadAttibute(pf1550_handle_t *handle, const pf1550_power_on_attribute_t *attribute)
{
    assert(handle);
    assert(attribute);

    /* Set Power Control Register 1. */
    (void)PF1550_ModifyReg(
        handle, PF1550_PWRCTRL1,
        PF1550_PWRCTRL1_PWRONDBNC_MASK | PF1550_PWRCTRL1_PWRONRSTEN_MASK | PF1550_PWRCTRL1_RESTARTEN_MASK,
        ((uint8_t)attribute->debounce |
         (attribute->longPressGoToRegsDisableOrSleep ? PF1550_PWRCTRL1_PWRONRSTEN_MASK : 0U) |
         (attribute->longPressRestartToRunStauts ? PF1550_PWRCTRL1_RESTARTEN_MASK : 0U)));
}

void PF1550_SetStandbyPadAttibute(pf1550_handle_t *handle, const pf1550_standby_attribute_t *attribute)
{
    assert(handle);
    assert(attribute);

    /* Set Power Control Register 0. */
    (void)PF1550_ModifyReg(
        handle, PF1550_PWRCTRL0, PF1550_PWRCTRL0_STANDBYDLY_MASK | PF1550_PWRCTRL0_STANDBYINV_MASK,
        (uint8_t)attribute->standbyDelay | (uint8_t)PF1550_PWRCTRL0_STANDBYINV(attribute->standbyPolarity));
}

pf1550_operating_status_t PF1550_GetOperatingStatus(pf1550_handle_t *handle)
{
    uint8_t operatingStatus = 0U;

    assert(handle);

    (void)PF1550_ReadReg(handle, PF1550_STATE_INFO, &operatingStatus);

    return (pf1550_operating_status_t)((uint8_t)(operatingStatus & 0x7U));
}

bool PF1550_IsRegulatorSupportDvs(pf1550_handle_t *handle, pf1550_module_t module)
{
    uint8_t registerContent = 0U;
    bool result;

    assert(handle);

    switch (module)
    {
        /* Switch1 DVS is enabled/disabled in OPT Configuration. */
        case kPF1550_ModuleSwitch1:
            (void)PF1550_ReadOtp(handle, PF1550_OTP_SW1_SW2, &registerContent);
            result = ((PF1550_OTP_SW1_SW2_OTP_SW1_DVS_ENB_MASK & registerContent) != 0U) ? false : true;
            break;

        /* Switch2 DVS is enabled/disabled in OPT Configuration. */
        case kPF1550_ModuleSwitch2:
            (void)PF1550_ReadOtp(handle, PF1550_OTP_SW2_SW3, &registerContent);
            result = ((PF1550_OTP_SW2_SW3_OTP_SW2_DVS_ENB_MASK & registerContent) != 0U) ? false : true;
            break;

        /* LDOs always support DVS feature. */
        case kPF1550_ModuleLdo1:
        case kPF1550_ModuleLdo2:
        case kPF1550_ModuleLdo3:
            result = true;
            break;

        /* Switch3, Vsnvs and Vref DDR does not support DVS in all OPT Configuration. */
        case kPF1550_ModuleSwitch3:
        case kPF1550_ModuleVsnvs:
        case kPF1550_ModuleVrefDdr:
            result = false;
            break;

        default:
            result = false;
            break;
    }

    return result;
}

/*******************************************************************************
 * EOF
 ******************************************************************************/
